#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation Success! The configuration is valid.


#### Terraform Plan `success`


```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_iam_role.eks_nodes: Refreshing state... [id=eks-node-group]
aws_iam_role.eks_cluster: Refreshing state... [id=eks-cluster]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-20200903220630174600000003]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-20200903220630207700000004]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-20200903220630225600000005]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-20200903220630124700000001]
aws_iam_role_policy_attachment.AmazonEKSServicePolicy: Refreshing state... [id=eks-cluster-20200903220630135200000002]
aws_eks_cluster.aws_eks: Refreshing state... [id=codimd-cluster]
aws_eks_node_group.node: Refreshing state... [id=codimd-cluster:codimd_nodes]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.dynamodb-terraform-state-lock will be created
  + resource "aws_dynamodb_table" "dynamodb-terraform-state-lock" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-state-lock-dynamo"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + write_capacity   = 20

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```


*Pusher: @msaavedra91, Action: `pull_request`, Working Directory: `.`, Workflow: `Create terraform plan`*